Final Capistone
Data Name - Uber Pickups in New York City
Data Link - https://www.kaggle.com/fivethirtyeight/uber-pickups-in-new-york-city
Mentor - Edward Plata

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.formula.api as smf
import datetime as dt
import seaborn as sns

In [9]:
american = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-American_B01362.csv')
carmel = pd.read_csv('C:/Users/vagne/Desktop/capis_data/Carmel_B00256.csv', encoding = 'cp1252')
dial7 = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Dial7_B00887.csv')
diplo = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Diplo_B01196.csv', encoding = 'cp1252')
highclass = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Highclass_B01717.csv', encoding = 'cp1252')
skyline = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Skyline_B00111.csv')
federal = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Federal_02216.csv')
lyft = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Lyft_B02510.csv')
firstclass = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Firstclass_B01536.csv', encoding = 'cp1252')
prestige = pd.read_csv('C:/Users/vagne/Desktop/capis_data/other-Prestige_B01338.csv', encoding = 'cp1252')

In [3]:
uber_jul = pd.read_csv('C:/Users/vagne/Desktop/capis_data/uber-raw-data-jul14.csv')
uber_aug = pd.read_csv('C:/Users/vagne/Desktop/capis_data/uber-raw-data-aug14.csv')
uber_sep = pd.read_csv('C:/Users/vagne/Desktop/capis_data/uber-raw-data-sep14.csv')

In [4]:
uber_jul.columns = uber_jul.columns.str.replace ('/','_')
uber_aug.columns = uber_aug.columns.str.replace ('/','_')
uber_sep.columns = uber_sep.columns.str.replace ('/','_')

In [35]:
print(uber_jul.shape)
print(uber_aug.shape)
print(uber_sep.shape)

(796121, 4)
(829275, 4)
(1028136, 4)

In [159]:
uber_data = uber_jul.append(uber_aug, ignore_index=True)

In [160]:
uber_data = uber_data.append(uber_sep, ignore_index = True)

In [161]:
uber_data.shape

(2653532, 4)

In [162]:
uber_data['Date_Time'] = pd.to_datetime(uber_data['Date_Time'])

In [42]:
print (american.shape)
print (carmel.shape)
print (dial7.shape)
print (diplo.shape)
print (highclass.shape)
print (skyline.shape)
print (federal.shape)
print (lyft.shape)
print (firstclass.shape)
print (prestige.shape)

(91712, 6)
(256519, 4)
(194992, 6)
(98550, 3)
(151925, 3)
(127696, 6)
(276, 7)
(267701, 4)
(166769, 3)
(320641, 3)

In [75]:
#print (american.info())
#print (carmel.info())
#print (dial7.info())
#print (diplo.info())
#print (highclass.info())
#print (skyline.info())
#print (federal.info())
print (lyft.info())
#print (firstclass.info())
#print (prestige.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 267701 entries, 0 to 267700
Data columns (total 4 columns):
time_of_trip    267701 non-null object
start_lat       267700 non-null float64
start_lng       267700 non-null float64
Unnamed: 3      1198 non-null object
dtypes: float64(2), object(2)
memory usage: 8.2+ MB
None

In [45]:
print (american.describe())
print (carmel.describe())
print (dial7.describe())
print (diplo.describe())
print (highclass.describe())
print (skyline.describe())
print (federal.describe())
print (lyft.describe())
print (firstclass.describe())
print (prestige.describe())

       Unnamed: 3  Unnamed: 4  Unnamed: 5
count         0.0         0.0         0.0
mean          NaN         NaN         NaN
std           NaN         NaN         NaN
min           NaN         NaN         NaN
25%           NaN         NaN         NaN
50%           NaN         NaN         NaN
75%           NaN         NaN         NaN
max           NaN         NaN         NaN
             Date    Time PU_Adress Base_No
count      256519  256519    256519  256519
unique         92    1427     63738       7
top     9/18/2014   15:00       JFK  B00256
freq         3507    4547     28179  249080
              Date    Time                                              State  \
count       194992  194992                                             194992
unique          92    1440                                               1001
top     2014.09.18   15:00  NY                                            ...
freq          2795    3674                                             133408

           PuFrom Address                Street
count      157962  194992                194992
unique       1264    4328                  9566
top     MANHATTAN
freq       113625   54397                 54148
             Date        Time                        PU_Address
count       98550       98550                             98550
unique         92        1442                             15122
top     9/13/2014  8:40:00 AM  BASE 170 W Fordham Rd Jerome, BX
freq         1440         174                              3293
             DATE        TIME                    PU_Address
count      151925      151925                        151925
unique         92        1472                         26950
top     9/13/2014  9:45:00 AM   268 W Fordham Rd Jerome, BX
freq         2375         285                          1506
       Unnamed: 4  Unnamed: 5
count         0.0         0.0
mean          NaN         NaN
std           NaN         NaN
min           NaN         NaN
25%           NaN         NaN
50%           NaN         NaN
75%           NaN         NaN
max           NaN         NaN
              Date      Time  \
count          276       276
unique          83        95
top     07/03/2014  10:00 AM
freq            12        11

                                               PU_Address  \
count                                                 269
unique                                                240
top     John F Kennedy International Airport, Delta Ai...
freq                                                    4

                                    DO_Address  \
count                                      267
unique                                     129
top     John F Kennedy International Airport;
freq                                        70

                                          Routing Details  \
count                                                 276
unique                                                264
top     PU: 607 20 St., BK NY; DO: John F Kennedy Inte...
freq                                                    3

                                             PU_Address.1   Status
count                                                 276      276
unique                                                264        3
top     607 20 St., BK NY; DO: John F Kennedy Internat...  Arrived
freq                                                    3      128
           start_lat      start_lng
count  267700.000000  267700.000000
mean       40.730292     -73.964948
std         0.043578       0.043445
min        40.527850     -74.226890
25%        40.708870     -73.991080
50%        40.733450     -73.978120
75%        40.756600     -73.952300
max        40.935620     -73.723150
            DATE        TIME         PICK UP ADDRESS
count     166769      166769                  166769
unique        92        1443                   28388
top     7/2/2014  9:00:00 AM  base 4980 Broadway NYC
freq        2228        1822                    3137
             DATE         TIME                     PICK UP ADDRESS
count      320641       320641                              320641
unique         92         1463                               52480
top     9/13/2014  10:00:00 AM  PRESTIGE #1 3108 Webster Ave Bronx
freq         4470          391                                2051

In [10]:
american.head()

,DATE,TIME,PICK UP ADDRESS,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,7/1/2014,12:00:00 AM,"874 E 139th St Mott Haven, BX",NaN,NaN,NaN
1,7/1/2014,12:01:00 AM,"628 E 141st St Mott Haven, BX",NaN,NaN,NaN
2,7/1/2014,12:01:00 AM,"601 E 156th St South Bronx, BX",NaN,NaN,NaN
3,7/1/2014,12:01:00 AM,"708 E 138th St Mott Haven, BX",NaN,NaN,NaN
4,7/1/2014,12:02:00 AM,"700 E 140th St Mott Haven, BX",NaN,NaN,NaN

In [11]:
#Rename columns to identify on the merge
american.rename(columns = {'TIME':'time_amer', 'PICK UP ADDRESS':'pick_up_add_amer'}, inplace = True)

In [12]:
#Drop stupd columns
american.drop(['Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5'], axis=1, inplace=True)

In [14]:
american.head()

       DATE    time_amer                 pick_up_add_amer
0  7/1/2014  12:00:00 AM    874 E 139th St Mott Haven, BX
1  7/1/2014  12:01:00 AM    628 E 141st St Mott Haven, BX
2  7/1/2014  12:01:00 AM   601 E 156th St South Bronx, BX
3  7/1/2014  12:01:00 AM    708 E 138th St Mott Haven, BX
4  7/1/2014  12:02:00 AM    700 E 140th St Mott Haven, BX

In [135]:
carmel.head()

       Date  Time        PU_Adress Base_No
0  7/1/2014  0:00  260 W 44 St NYC  B00256
1  7/1/2014  0:00  125 W 29 St Nyc  B00256
2  7/1/2014  0:00  141 W 28 St Nyc  B00256
3  7/1/2014  0:01              EWR  B00256
4  7/1/2014  0:07              JFK  B00256

In [66]:
carmel.drop(['Base_No'], axis = 1, inplace=True)

             Date time_carm pick_up_add_carm
0      2014-07-01      0:00  260 W 44 St NYC
1      2014-07-01      0:00  125 W 29 St Nyc
2      2014-07-01      0:00  141 W 28 St Nyc
3      2014-07-01      0:01              EWR
4      2014-07-01      0:07              JFK
...           ...       ...              ...
256514 2014-09-30     23:53              JFK
256515 2014-09-30     23:55   5 Allen St Nyc
256516 2014-09-30     23:56              JFK
256517 2014-09-30     23:58              EWR
256518 2014-09-30     23:59              JFK

[256519 rows x 3 columns]

In [136]:
carmel.rename(columns = {'Date':'DATE', 'Time':'time_carm', 'PU_Adress':'pick_up_add_carm'}, inplace = True)

In [82]:
dial7.head()

,Date,Time,State,PuFrom,Address,Street
0,2014.07.06,14:30,NY ...,MANHATTAN,50,MURRAY ST
1,2014.07.04,7:15,NY ...,MANHATTAN,143,AVENUE B
2,2014.07.05,5:45,NY ...,MANHATTAN,125,CHRISTOPHER ST
3,2014.07.06,4:30,NY ...,MANHATTAN,217,E 7 ST
4,2014.07.05,7:45,NY ...,MANHATTAN,521,W 26 ST

In [84]:
dial7['pick_up_add_dia'] = dial7['Address'] + ' ' + dial7['Street'] + ', ' + dial7['PuFrom']
dial7.head()

,Date,Time,State,PuFrom,Address,Street,pick_up_add_dia
0,2014.07.06,14:30,NY ...,MANHATTAN,50,MURRAY ST,50 MURRAY ST MANHATTAN
1,2014.07.04,7:15,NY ...,MANHATTAN,143,AVENUE B,143 AVENUE B MANHATTAN
2,2014.07.05,5:45,NY ...,MANHATTAN,125,CHRISTOPHER ST,125 CHRISTOPHER ST MANHATTAN
3,2014.07.06,4:30,NY ...,MANHATTAN,217,E 7 ST,217 E 7 ST MANHATTAN
4,2014.07.05,7:45,NY ...,MANHATTAN,521,W 26 ST,521 W 26 ST MANHATTAN

In [86]:
dial7.drop(['State', 'PuFrom', 'Address', 'Street'], axis = 1, inplace=True)

              Date   Time                     pick_up_add_dia
0       2014.07.06  14:30   50 MURRAY ST            MANHATTAN
1       2014.07.04   7:15  143 AVENUE B             MANHATTAN
2       2014.07.05   5:45  125 CHRISTOPHER ST       MANHATTAN
3       2014.07.06   4:30  217 E 7 ST               MANHATTAN
4       2014.07.05   7:45  521 W 26 ST              MANHATTAN
...            ...    ...                                 ...
194987  2014.09.28  21:50                                 Jfk
194988  2014.09.28   7:00  112 W 78 ST              MANHATTAN
194989  2014.09.28  15:30  601 W 57 ST              MANHATTAN
194990  2014.09.28  19:55                                 NaN
194991  2014.09.08   9:45  415 W 24 ST              MANHATTAN

[194992 rows x 3 columns]

In [87]:
dial7.rename(columns = {'Date':'DATE', 'Time':'time_dia'}, inplace = True)

In [88]:
diplo.head()

       Date         Time                           PU_Address
0  7/1/2014  12:00:00 AM       2396 Valentine Ave Fordham, BX
1  7/1/2014  12:01:00 AM   1859 Walton Ave Morris Heights, BX
2  7/1/2014  12:02:00 AM           2431 Jerome Ave Jerome, BX
3  7/1/2014  12:05:00 AM       3044 Valentine Ave Fordham, BX
4  7/1/2014  12:05:00 AM      1085 Nelson Ave High Bridge, BX

In [90]:
diplo.rename(columns = {'Date':'DATE', 'Time':'time_dip', 'PU_Address':'pick_up_add_dip'}, inplace = True)

In [91]:
highclass.head()

       DATE         TIME                          PU_Address
0  7/1/2014  12:00:00 AM         2976 Marion Ave Fordham, BX
1  7/1/2014  12:01:00 AM   780 Grand Concourse Cortlandt, BX
2  7/1/2014  12:01:00 AM       105 Elliot Pl High Bridge, BX
3  7/1/2014  12:03:00 AM                 2825 Webb Ave Bronx
4  7/1/2014  12:04:00 AM   1878 Cedar Ave Morris Heights, BX

In [92]:
highclass.rename(columns = {'TIME':'time_high', 'PU_Address':'pick_up_add_high'}, inplace = True)

In [95]:
skyline.head()

,Date,Time,Street_Address,City_State,Unnamed: 4,Unnamed: 5
0,7/1/2014,20:27,622 THIRD AV,M,NaN,NaN
1,7/1/2014,21:04,E 77TH ST,M,NaN,NaN
2,7/1/2014,22:20,67 WEST PALISADES BLVD,PALISADES PARK NJ,NaN,NaN
3,7/1/2014,12:28,130 MIDDLE NECK RD,SANDS POINT LI,NaN,NaN
4,7/1/2014,16:45,36 E 31ST ST,M,NaN,NaN

In [105]:
skyline.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 127696 entries, 0 to 127695
Data columns (total 7 columns):
Date                   127696 non-null object
Time                   127696 non-null object
    Street_Address     127696 non-null object
    City_State         127696 non-null object
Unnamed: 4             0 non-null float64
Unnamed: 5             0 non-null float64
pick_up_add_sky        127696 non-null object
dtypes: float64(2), object(5)
memory usage: 6.8+ MB

In [103]:
skyline['pick_up_add_sky'] = skyline['    Street_Address '] + ', ' + skyline['    City_State ']

In [106]:
skyline.drop(['    Street_Address ', '    City_State ', 'Unnamed: 4', 'Unnamed: 5'], axis = 1, inplace=True)

,Date,Time,pick_up_add_sky
0,7/1/2014,20:27,"622 THIRD AV , M ..."
1,7/1/2014,21:04,"E 77TH ST , M ..."
2,7/1/2014,22:20,"67 WEST PALISADES BLVD , PALISADE..."
3,7/1/2014,12:28,"130 MIDDLE NECK RD , SANDS PO..."
4,7/1/2014,16:45,"36 E 31ST ST , M ..."
...,...,...,...
127691,9/29/2014,13:15,"370 7th AVE , M ..."
127692,9/29/2014,15:40,"1 STATE ST PZ , M ..."
127693,9/29/2014,20:07,"730 5TH AVE , M ..."
127694,9/29/2014,22:48,"30 ROCKEFELLER PZ , M ..."
127695,9/29/2014,16:00,"904 LEXINGTON AV , M ..."

In [108]:
skyline.rename(columns = {'Date':'DATE', 'TIME':'time_sky'}, inplace = True)

In [110]:
federal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 276 entries, 0 to 275
Data columns (total 7 columns):
Date               276 non-null object
Time               276 non-null object
PU_Address         269 non-null object
DO_Address         267 non-null object
Routing Details    276 non-null object
PU_Address.1       276 non-null object
Status             276 non-null object
dtypes: object(7)
memory usage: 15.2+ KB

In [111]:
federal.drop(['DO_Address', 'Routing Details', 'PU_Address.1', 'Status'], axis = 1, inplace=True)

           Date      Time                                       PU_Address
0    07/01/2014  07:15 AM       Brooklyn Museum, 200 Eastern Pkwy., BK NY;
1    07/01/2014  07:30 AM                   33 Robert Dr., Short Hills NJ;
2    07/01/2014  08:00 AM                         60 Glenmore Ave., BK NY;
3    07/01/2014  09:00 AM                          128 East 31 St., BK NY;
4    07/01/2014  09:30 AM                     139-39 35 Ave., Flushing NY;
..          ...       ...                                              ...
271  09/25/2014  12:00 PM  907 59 St., BK NY; ST: W66 St./Broadway, NY NY;
272  09/26/2014  04:00 PM                              20 West St., NY NY;
273  09/27/2014  05:00 AM                       474 Sackett Street, BK NY;
274  09/27/2014  08:00 AM                       474 Sackett Street, BK NY;
275  09/28/2014  09:00 PM                               152 7 Ave., BK NY;

[276 rows x 3 columns]

In [112]:
federal.rename(columns = {'Date':'DATE', 'Time':'time_fed', 'PU_Address':'pick_up_add_fed'}, inplace = True)

In [113]:
lyft.head()

      time_of_trip  start_lat  start_lng Unnamed: 3
0    9/4/2014 9:51   40.64705  -73.77988        NaN
1  8/27/2014 21:13   40.74916  -73.98373        NaN
2   9/4/2014 14:16   40.64065  -73.97594        NaN
3   9/4/2014 16:08   40.75002  -73.99514        NaN
4   8/28/2014 2:41   40.76715  -73.98636        NaN

In [114]:
lyft[['DATE','time_lyf']] = lyft.time_of_trip.str.split(' ', expand=True)

In [116]:
lyft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 267701 entries, 0 to 267700
Data columns (total 6 columns):
time_of_trip    267701 non-null object
start_lat       267700 non-null float64
start_lng       267700 non-null float64
Unnamed: 3      1198 non-null object
DATE            267701 non-null object
time_lyf        267701 non-null object
dtypes: float64(2), object(4)
memory usage: 12.3+ MB

In [117]:
lyft['pick_up_add_lyf'] = lyft['start_lat'].map(str) + ' ' + lyft['start_lng'].map(str)

In [118]:
lyft.drop(['time_of_trip', 'Unnamed: 3'], axis = 1, inplace=True)

,start_lat,start_lng,DATE,time_lyf,pick_up_add_lyf
0,40.64705,-73.77988,9/4/2014,9:51,40.64705 -73.77988
1,40.74916,-73.98373,8/27/2014,21:13,40.749159999999996 -73.98373000000001
2,40.64065,-73.97594,9/4/2014,14:16,40.64065 -73.97594000000001
3,40.75002,-73.99514,9/4/2014,16:08,40.75002 -73.99514
4,40.76715,-73.98636,8/28/2014,2:41,40.76715 -73.98635999999999
...,...,...,...,...,...
267696,40.71931,-73.99138,9/7/2014,3:19,40.71931 -73.99138
267697,40.73868,-73.98862,9/7/2014,2:59,40.73868 -73.98862
267698,40.71554,-73.94877,9/7/2014,1:55,40.715540000000004 -73.94877
267699,40.74667,-73.97445,9/5/2014,23:26,40.74667 -73.97445
267700,40.74393,-73.78011,9/6/2014,22:19,40.74393 -73.78011

In [119]:
firstclass.head()

       DATE         TIME                 PICK UP ADDRESS
0  7/1/2014  12:02:00 AM   5360 Broadway Kingsbridge, BX
1  7/1/2014  12:02:00 AM                546 Isham St NYC
2  7/1/2014  12:03:00 AM           234 Bradhurst Ave NYC
3  7/1/2014  12:07:00 AM        99 Marble Hill Ave Bronx
4  7/1/2014  12:08:00 AM           120 Vermilyea Ave NYC

In [120]:
firstclass.rename(columns = {'TIME':'time_fir', 'PICK UP ADDRESS':'pick_up_add_fir'}, inplace = True)

In [121]:
prestige.head()

       DATE         TIME                          PICK UP ADDRESS
0  7/1/2014  12:00:00 AM              2557 Marion Ave Fordham, BX
1  7/1/2014  12:00:00 AM   45 E Mosholu Pkwy N Williamsbridge, BX
2  7/1/2014  12:00:00 AM            458 E 143rd St Mott Haven, BX
3  7/1/2014  12:02:00 AM  MINIVAN SUV 2557 Marion Ave Fordham, BX
4  7/1/2014  12:02:00 AM        1117 Westchester Ave Foxhurst, BX

In [122]:
prestige.rename(columns = {'TIME':'time_pre', 'PICK UP ADDRESS':'pick_up_add_pre'}, inplace = True)

In [123]:
uber_data.head()

            Date_Time      Lat      Lon    Base
0 2014-07-01 00:03:00  40.7586 -73.9706  B02512
1 2014-07-01 00:05:00  40.7605 -73.9994  B02512
2 2014-07-01 00:06:00  40.7320 -73.9999  B02512
3 2014-07-01 00:09:00  40.7635 -73.9793  B02512
4 2014-07-01 00:20:00  40.7204 -74.0047  B02512

In [124]:
uber_data['pick_up_add_ube'] = uber_data['Lat'].map(str) + ' ' + uber_data['Lon'].map(str)

In [127]:
uber_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2653532 entries, 0 to 2653531
Data columns (total 5 columns):
Date_Time          datetime64[ns]
Lat                float64
Lon                float64
Base               object
pick_up_add_ube    object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 101.2+ MB

In [130]:
uber_data['DATE'] = uber_data['Date_Time'].dt.date
uber_data['time_ube'] = uber_data['Date_Time'].dt.time

In [131]:
uber_data.drop(['Base', 'Date_Time'], axis = 1, inplace=True)

             Lat      Lon   pick_up_add_ube        DATE  time_ube
0        40.7586 -73.9706  40.7586 -73.9706  2014-07-01  00:03:00
1        40.7605 -73.9994  40.7605 -73.9994  2014-07-01  00:05:00
2        40.7320 -73.9999   40.732 -73.9999  2014-07-01  00:06:00
3        40.7635 -73.9793  40.7635 -73.9793  2014-07-01  00:09:00
4        40.7204 -74.0047  40.7204 -74.0047  2014-07-01  00:20:00
...          ...      ...               ...         ...       ...
2653527  40.7668 -73.9845  40.7668 -73.9845  2014-09-30  22:57:00
2653528  40.6911 -74.1773  40.6911 -74.1773  2014-09-30  22:57:00
2653529  40.8519 -73.9319  40.8519 -73.9319  2014-09-30  22:58:00
2653530  40.7081 -74.0066  40.7081 -74.0066  2014-09-30  22:58:00
2653531  40.7140 -73.9496   40.714 -73.9496  2014-09-30  22:58:00

[2653532 rows x 5 columns]

Checking dates to compare the same period

In [19]:
american['DATE'] = pd.to_datetime(american['DATE'])
carmel['DATE'] = pd.to_datetime(carmel['DATE'])
dial7['DATE'] = pd.to_datetime(dial7['DATE'])
diplo['DATE'] = pd.to_datetime(diplo['DATE'])
highclass['DATE'] = pd.to_datetime(highclass['DATE'])
skyline['DATE'] = pd.to_datetime(skyline['DATE'])
federal['DATE'] = pd.to_datetime(federal['DATE'])
lyft['DATE'] = pd.to_datetime(lyft['DATE'])
firstclass['DATE'] = pd.to_datetime(firstclass['DATE'])
prestige['DATE'] = pd.to_datetime(prestige['DATE'])
uber_data['DATE'] = pd.to_datetime(uber_data['DATE'])

KeyError: 'DATE'

In [133]:
print (min(american.DATE))
print (max(american.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [138]:
print (min(carmel.DATE))
print (max(carmel.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [139]:
print (min(dial7.DATE))
print (max(dial7.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [140]:
print (min(diplo.DATE))
print (max(diplo.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [141]:
print (min(highclass.DATE))
print (max(highclass.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [142]:
print (min(skyline.DATE))
print (max(skyline.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [143]:
print (min(federal.DATE))
print (max(federal.DATE))

2014-07-01 00:00:00
2014-09-28 00:00:00

In [144]:
print (min(lyft.DATE))
print (max(lyft.DATE))

2014-07-25 00:00:00
2014-09-30 00:00:00

In [145]:
print (min(firstclass.DATE))
print (max(firstclass.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [146]:
print (min(prestige.DATE))
print (max(prestige.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

In [149]:
print (min(uber_data.DATE))
print (max(uber_data.DATE))

2014-07-01 00:00:00
2014-09-30 00:00:00

Minimum date should be 2014-07-25 00:00:00
Maximum date should be 2014-09-28 00:00:00
https://www.geeksforgeeks.org/drop-rows-from-the-dataframe-based-on-certain-condition-applied-on-a-column/

Filter all tables by minimum and maximum date to equally compare the companies.
Rename it as 'company name_1'

In [150]:
#MINIMUM
american_1 = american[american['DATE'] >= '2014-07-25']
carmel_1 = carmel[carmel['DATE'] >= '2014-07-25']
dial7_1 = dial7[dial7['DATE'] >= '2014-07-25']
diplo_1 = diplo[diplo['DATE'] >= '2014-07-25']
highclass_1 = highclass[highclass['DATE'] >= '2014-07-25']
skyline_1 = skyline[skyline['DATE'] >= '2014-07-25']
federal_1 = federal[federal['DATE'] >= '2014-07-25']
lyft_1 = lyft[lyft['DATE'] >= '2014-07-25']
firstclass_1 = firstclass[firstclass['DATE'] >= '2014-07-25']
prestige_1 = prestige[prestige['DATE'] >= '2014-07-25']
uber_data_1 = uber_data[uber_data['DATE'] >= '2014-07-25']

In [151]:
#MAXIMUM
american_1 = american[american['DATE'] <= '2014-09-28']
carmel_1 = carmel[carmel['DATE'] <= '2014-09-28']
dial7_1 = dial7[dial7['DATE'] <= '2014-09-28']
diplo_1 = diplo[diplo['DATE'] <= '2014-09-28']
highclass_1 = highclass[highclass['DATE'] <= '2014-09-28']
skyline_1 = skyline[skyline['DATE'] <= '2014-09-28']
federal_1 = federal[federal['DATE'] <= '2014-09-28']
lyft_1 = lyft[lyft['DATE'] <= '2014-09-28']
firstclass_1 = firstclass[firstclass['DATE'] <= '2014-09-28']
prestige_1 = prestige[prestige['DATE'] <= '2014-09-28']
uber_data_1 = uber_data[uber_data['DATE'] <= '2014-09-28']

In [20]:
american['DATE'] = pd.to_datetime(american['DATE'])

In [25]:
american_1 = american[(american['DATE'] >= '2014-07-25') & (american['DATE'] <= '2014-09-28')]
carmel_1 = carmel[(carmel['DATE'] >= '2014-07-25') & (carmel['DATE'] <= '2014-09-28')]
dial7_1 = dial7[(dial7['DATE'] >= '2014-07-25') & (dial7['DATE'] <= '2014-09-28')]
diplo_1 = diplo[(diplo['DATE'] >= '2014-07-25') & (diplo['DATE'] <= '2014-09-28')]
highclass_1 = highclass[(highclass['DATE'] >= '2014-07-25') & (highclass['DATE'] <= '2014-09-28')]
skyline_1 = sykline[(skyline['DATE'] >= '2014-07-25') & (skyline['DATE'] <= '2014-09-28')]
federal_1 = federal[(federal['DATE'] >= '2014-07-25') & (federal['DATE'] <= '2014-09-28')]
lyft_1 = lyft[(lift['DATE'] >= '2014-07-25') & (lyft['DATE'] <= '2014-09-28')]
fisrtclass_1 = fisrtclass[(fisrtclass['DATE'] >= '2014-07-25') & (fisrtclass['DATE'] <= '2014-09-28')]
prestige_1 = prestige[(prestige['DATE'] >= '2014-07-25') & (prestige['DATE'] <= '2014-09-28')]
uber_data_1 = uber_data[(uber_data['DATE'] >= '2014-07-25') & (uber_data['DATE'] <= '2014-09-28')]

In [26]:
american_1.head()

            DATE    time_amer                  pick_up_add_amer
23686 2014-07-25  12:02:00 AM     675 E 140th St Mott Haven, BX
23687 2014-07-25  12:03:00 AM     545 E 145th St Mott Haven, BX
23688 2014-07-25  12:05:00 AM   80 Bruckner Blvd Mott Haven, BX
23689 2014-07-25  12:05:00 AM     515 E 143rd St Mott Haven, BX
23690 2014-07-25  12:06:00 AM     515 E 143rd St Mott Haven, BX

In [28]:
print (min(american_1.DATE))
print (max(american_1.DATE))

2014-07-25 00:00:00
2014-09-28 00:00:00